yawCaseTemplate/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include 	"include/initialConditions"
#include 	"../system/aspectRatio"
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    
     #includeEtc "caseDicts/setConstraintTypes"

	inlet
	{
		type  codedFixedValue;
		value $internalField;
		name ablProfile;
		
		code
		#{
		const fvPatch& boundaryPatch = patch();
		const vectorField& Cf = boundaryPatch.Cf();
		vectorField& field = *this;
   
		//These values can change but are what all the models were ran at
		scalar Ut = 6.37, z0 = 0.017, hb = 13, ht = 15.25; //input values (ht is 2.25 above)

		//The below value SHOULD BE CHANGED BASED ON THE HEIGHT OF YOUR MODEL.
		//The above input values are set for a building height of 13m. This value should be = Your building height - 13m
		//For example, since this model is set to an aspect ratio of 1 with a characteristic length of 13m, the building
		//height is 13m, so it is set to 0. If the aspect ratio was raised to 2, then this value should also raise to 13.
		//This is in order to shift the inlet profile down as the domain is also shifted down
		scalar y_diff = 0; 

		//The below value should be changed based on the input yaw angle you want the flow to flow in! The default, 0 deg,
		//will make the flow hit the building head on, and the increase in angle will increase the angle of the flow 
		//relative to the +x direction in a clockwise direction when looking from above, such that when the input angle
		// = 90 deg, the flow will be in the positive z direction
		scalar yaw_angle_deg = 45;

		// Converts the degrees to radians because that's how OpenFOAM rolls
		scalar yaw_angle_rad = yaw_angle_deg * constant::mathematical::pi / 180.0;

		forAll(Cf, faceI)
		{
			const scalar y = Cf[faceI].y();
			const scalar Y = max(y+hb+z0+y_diff, 1e-6);  // establishes minimum in case goes below or equal to 0
			const scalar U = (Ut / log( (ht+z0) / z0)) * log(Y/z0);
    			
			// Rotate velocity according to yaw angle
    			const scalar Ux = U * cos(yaw_angle_rad);
    			const scalar Uz = U * sin(yaw_angle_rad);

    			field[faceI] = vector(Ux, 0.0, Uz);	 
			field[faceI] = vector(Ux, 0.0, Uz);	 
		} 
		#};
			 
		codeOptions
		#{
		-I$(FOAM_SRC)/finiteVolume/lnInclude \
		-I$(FOAM_SRC)/meshTools/lnInclude
		#};
		
		// codeInclude
		// #{
		// #include "fvCFD.H"
		// #include <cmath>
		// #include <iostream>
		// #};
	}


    outlet
    {
    	type		inletOutlet;
   	inletValue 	uniform (0 0 0);
  	value		$internalField; 
    }

    top
    {
	type		slip;
    }
    ground
    {
	type		noSlip;
    }
    building
    {
        type            noSlip;
    }
    spoiler
    {
        type            noSlip;
    }
  /*
Just taking 'em out
    leftSide
    {
        type            slip;
    }
    rightSide
    {
        type            slip;
    }
*/
}