yawCaseTemplate/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"include/initialConditions"
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $turbulentKE;

boundaryField
{
   
    inlet
    {
	#includeEtc "caseDicts/setConstraintTypes"
        type  codedFixedValue;
		value $internalField;
		name ablProfile_k;
		
		code
		#{
		const fvPatch& boundaryPatch = patch();
		scalarField& field = *this;   

		//These values can change but are what all the models were ran at
		scalar Ut = 6.37, hb = 13, z0 = 0.017, ht = 15.25; //input values (ht is 2.25 above)
		scalar kappa = 0.41, Cmu = 0.09;
		
		const scalar u_star = (kappa * Ut) / log((ht + z0) / z0);
		const scalar k_inlet = (u_star * u_star) / sqrt(Cmu);
		
		forAll(field, faceI)
		{
			field[faceI] = k_inlet;
		}
		#};
			 
		codeOptions
		#{
		-I$(FOAM_SRC)/finiteVolume/lnInclude \
		-I$(FOAM_SRC)/meshTools/lnInclude
		#};
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
     
    }

    building
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    spoiler
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    ground
    {
        type            kqRWallFunction;
        value           $internalField;
    }
/*
Just taking 'em out
    leftSide
    {
        type            zeroGradient;
    }
    rightSide
    {
        type            zeroGradient;
    }
*/

}


// ************************************************************************* //
